// split перетворює рядок в масим по роздільнику, який ми зазначимо

// const message = "дозволяє перетворити рядок в масив, розбивши її по розподілу"
// console.log(message.split(","));

// join приєднує елементи масиву розділяючи зазначеним сполучником

// const friends = ["Mango", "Poly", "Kiwi", "Ajax"];
// console.log(friends.join(",'"));


//Робимо slug з назви статті з URL адреси,
// Заголовок статті складається тільки з букв та пропусків,
// Нормалізуємо рядок,
// Розбиваємо по словах,
// Записуємо в рядок з роздільником,
// Чейнінг
// повинно получитися top-10-benefits-of-react-fremework

// const title = "Top 10 Benefits Of React Fremework";
// const eddits = title.toLocaleLowerCase().split(" ").join("-");
// console.log(eddits);

// Знайти індех елементу використовуючи indexOf, якщо не знайшов то повертає -1

// const friends = ["Mango", "Poly", "Kiwi", "Ajax"];
// const findName = "Poly";
// const indexElement = friends.indexOf(findName)
// console.log(indexElement);


// const friends = ["Mango", "Poly", "Kiwi", "Ajax"];
// friends.unshift("Max", "Sara")
// console.log(friends);

// const friends = ["Mango", "Poly", "Kiwi", "Ajax"];
// friends.push("Max", "Sara", false, 1);
// console.log(friends);


// const friends = ["Mango", "Poly", "Kiwi", "Ajax"];
// friends.shift()
// console.log(friends);

// const friends = ["Mango", "Poly", "Kiwi", "Ajax"];
// friends.pop()
// console.log(friends);

// const friends = ["Mango", "Poly", "Kiwi", "Ajax"];
// const result = friends.shift()
// console.log(result);

// const names = [
//   "Олександр",
//   "Марія",
//   "Іван",
//   "Анастасія",
//   "Андрій",
//   "Олена",
//   "Дмитро",
//   "Катерина",
//   "Сергій",
//   "Юлія",
//   "Михайло",
//   "Вікторія",
//   "Богдан",
//   "Тетяна",
//   "Артур",
// ];

// const names2 = names;
// names.push("Max")
// console.log(names);
// console.log(names2);

// const copy = names.slice()
// console.log(copy);

// const num1 = [1, 2, 3, 4, 5];
// const num2 = [6, 7, 8, 9, 10];
// const num3 = [11, 12, 13, 14, 15];
// const result = num3.concat(num1,num2)
// console.log(result);


// Метод splice(), змінює оригінальний масив, робить з масивом все що завгодно

// const names = [
//   "Олександр",
//   "Марія",
//   "Іван",
//   "Анастасія",
//   "Андрій",
//   "Олена",
//   "Дмитро",
//   "Катерина",
//   "Сергій",
//   "Юлія",
//   "Михайло",
//   "Вікторія",
//   "Богдан",
//   "Тетяна",
//   "Артур",
// ];

// const copyNames = names.slice();

// Видалення елементів з масиву
// const result = copyNames.splice(0, 4);
// console.log(result);

// Додавання елементів до масиву без видалення
// copyNames.splice(12, 0, "Ігор", "Марія");
// console.log(copyNames);

// Додавання елементі з заміною
// copyNames.splice(5, 2, "ghbgfhbfg", "Vb[fqkj")
// console.log(copyNames);

//Задача 1 Створіть масив styles з елементами 'Джаз' i 'Блюз'. Додайте 'Рок-н-ролл' в кінець масиву. Замініть значення в середині масиву на 'Класика'. Видаліть перший елемент масиву і покажіть його. Додайте 'Реп' і 'Реггі' на початок масиву. Виведіть масив в консоль.

// const elements = ['Джаз', 'Блюз']
// elements.splice(2, 0, "Рок-н-ролл");
// elements.splice(1, 1, "Класика");
// const result = elements.splice(0, 1)
// console.log(result);
// elements.splice(0, 0, 'Реп' , 'Реггі')
// console.log(elements);

// const names = [
//   "Олександр",
//   "Марія",
//   "Іван",
//   "Анастасія",
//   "Андрій",
//   "Олена",
//   "Дмитро",
//   "Катерина",
//   "Сергій",
//   "Юлія",
//   "Михайло",
//   "Вікторія",
//   "Богдан",
//   "Тетяна",
//   "Артур",
//   "Ігор",
//   "Алла",
//   "Степан",
//   "Наталія",
//   "Павло",
//   "Ганна",
//   "Максим",
//   "Оксана",
//   "Ростислав",
//   "Лілія",
//   "Василь",
//   "Дарина",
//   "Єгор",
//   "Людмила",
//   "Світлана",
//   "Роман",
//   "Вероніка",
//   "Єлизавета",
//   "Олег",
//   "Мирослава",
//   "Віталій",
//   "Софія",
//   "Антон",
//   "Ніна",
//   "Зоряна",
//   "Валентина",
//   "Тимур",
//   "Кирило",
//   "Ілля",
//   "Валерія",
//   "Ярослав",
//   "Поліна",
//   "Галина",
//   "Владислав",
//   "Оксен",
//   "Любомир",
//   "Марта",
//   "Орися",
//   "Данило",
//   "Злата",
//   "Володимир",
//   "Каріна",
//   "Арсен",
//   "Емілія",
//   "Петро",
//   "Олексій",
//   "Роксолана",
//   "Олександра",
//   "Денис",
//   "Єва",
//   "Семен",
//   "Одарка",
//   "Остап",
//   "Еліза",
//   "Федір",
//   "Уляна",
//   "Мирон",
//   "Евеліна",
//   "Григорій",
//   "Інна",
//   "Савелій",
//   "Орися",
//   "Матвій",
//   "Жанна",
//   "Артем",
//   "Христина",
//   "Тарас",
//   "Олеся",
//   "Микола",
//   "Надія",
//   "Лев",
//   "Мирослава",
//   "Євген",
//   "Аліса",
//   "Анатолій",
//   "Аліна",
//   "Ксенія",
//   "Гриша",
//   "Руслан",
//   "Юрій",
//   "Станіслав",
//   "Леся",
//   "Фаїна",
//   "Елеонора",
// ];

// Не змінюючи оригінальну колекцію, знайти Юрія, замінити його на Максима

// const copy = names.slice();
// const findname = "Юрій";
// const index = copy.indexOf(findname);
// console.log(index);

// copy.splice(index, 1, "Максим")
// console.log(copy);



